Autodesk.Revit.DB.SaveOptions.PreviewViewId
The view id that will be used to generate the preview; this id is not saved to the document's permanent settings.
Remarks:
If this id is set, the indicated view will be used to generate the preview even if
DocumentPreviewSettings.PreviewViewId is also set.
The id must be valid for use as a preview view (check DocumentPreviewSettings.IsViewIdValidForPreview()).
Revit does not check validity when setting this value, only when the options are used in a call to SaveAs().
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012